#### Terraform Plan

<details><summary>Show Plan</summary>

```
data.aws_secretsmanager_secret.root_SlackToken_ABD13A0A: Reading...
aws_s3_bucket.root_Code_02F3C603: Refreshing state... [id=code-c84a50b1-20230626183101036300000006]
data.aws_secretsmanager_secret.root_GitHubToken_DD673C7C: Reading...
aws_iam_role.root_testgithub_Handler_IamRole_CD9B1CC3: Refreshing state... [id=terraform-20230626183101028900000001]
aws_iam_role.root_cloudScheduleOnTick52bc3c17_IamRole_BD9C52C9: Refreshing state... [id=terraform-20230626183101030200000003]
aws_cloudwatch_event_rule.root_cloudSchedule_3C0305D2: Refreshing state... [id=terraform-20230626183101029500000002]
aws_iam_role.root_testslack_Handler_IamRole_CA274585: Refreshing state... [id=terraform-20230626183101035100000005]
aws_iam_role.root_testdailyreport_Handler_IamRole_F191BB9A: Refreshing state... [id=terraform-20230626183101031500000004]
aws_iam_role_policy_attachment.root_cloudScheduleOnTick52bc3c17_IamRolePolicyAttachment_9914AE83: Refreshing state... [id=terraform-20230626183101030200000003-2023062618310126310000000a]
aws_iam_role_policy_attachment.root_testgithub_Handler_IamRolePolicyAttachment_A329EC6A: Refreshing state... [id=terraform-20230626183101028900000001-2023062618310131550000000d]
aws_iam_role_policy_attachment.root_testdailyreport_Handler_IamRolePolicyAttachment_F3F05187: Refreshing state... [id=terraform-20230626183101031500000004-2023062618310128340000000c]
aws_iam_role_policy_attachment.root_testslack_Handler_IamRolePolicyAttachment_CA39B758: Refreshing state... [id=terraform-20230626183101035100000005-2023062618310133500000000e]
data.aws_secretsmanager_secret.root_SlackToken_ABD13A0A: Read complete after 1s [id=arn:aws:secretsmanager:eu-west-2:248020555503:secret:eladb-slack-token-lrwT6D]
aws_iam_role_policy.root_testslack_Handler_IamRolePolicy_A5761B34: Refreshing state... [id=terraform-20230626183101035100000005:terraform-2023062618310128170000000b]
data.aws_secretsmanager_secret.root_GitHubToken_DD673C7C: Read complete after 1s [id=arn:aws:secretsmanager:eu-west-2:248020555503:secret:eladb-github-token-A0YErM]
aws_iam_role_policy.root_testdailyreport_Handler_IamRolePolicy_87ED802C: Refreshing state... [id=terraform-20230626183101031500000004:terraform-20230626183101215800000008]
aws_iam_role_policy.root_testgithub_Handler_IamRolePolicy_CF56856B: Refreshing state... [id=terraform-20230626183101028900000001:terraform-20230626183101227500000009]
aws_iam_role_policy.root_cloudScheduleOnTick52bc3c17_IamRolePolicy_0539269E: Refreshing state... [id=terraform-20230626183101030200000003:terraform-20230626183101201400000007]
aws_s3_object.root_testdailyreport_Handler_S3Object_1E303EC1: Refreshing state... [id=asset.c88332ad7d8b9f9ea4c0fdff28de763435757c653b.3016c04722a35a9458a886b17cf74c57.zip]
aws_s3_object.root_testgithub_Handler_S3Object_22575187: Refreshing state... [id=asset.c814841cf01b8d42bddc4a08d74592f0f4708c8c7c.5f1aa104124ec49ef59a6ceffeef629a.zip]
aws_s3_object.root_testslack_Handler_S3Object_E3F129BB: Refreshing state... [id=asset.c859c3453707ac3788c08b8722c2c8a136d1f97a00.7bf6b4f11c30258c7039a473e8a34d1a.zip]
aws_s3_object.root_cloudScheduleOnTick52bc3c17_S3Object_55D4C33B: Refreshing state... [id=asset.c8ce1e82e4dc4e1c2c47e323b3d9c585c3fda8f78b.bccffb41110a9072b4a86dc13009239b.zip]
aws_lambda_function.root_cloudScheduleOnTick52bc3c17_8AC5BAEC: Refreshing state... [id=cloud-Schedule-OnTick-52bc3c17-c8ce1e82]
aws_lambda_function.root_testdailyreport_Handler_EC292EB5: Refreshing state... [id=Handler-c88332ad]
aws_lambda_function.root_testgithub_Handler_210F9622: Refreshing state... [id=Handler-c814841c]
aws_lambda_function.root_testslack_Handler_6383EBD4: Refreshing state... [id=Handler-c859c345]
aws_lambda_permission.root_cloudScheduleOnTick52bc3c17_InvokePermissionc889a92213eec6eb0fed79fc42c0ee51e58b9f1242_B865CFAE: Refreshing state... [id=terraform-20230627084512130100000001]
aws_cloudwatch_event_target.root_cloudSchedule_ScheduleTarget52bc3c17_8964E208: Refreshing state... [id=terraform-20230626183101029500000002-terraform-20230626183128051200000010]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cloudwatch_event_target.root_cloudSchedule_ScheduleTarget52bc3c17_8964E208 will be updated in-place
  ~ resource "aws_cloudwatch_event_target" "root_cloudSchedule_ScheduleTarget52bc3c17_8964E208" {
      ~ arn            = "arn:aws:lambda:eu-west-2:248020555503:function:cloud-Schedule-OnTick-52bc3c17-c8ce1e82:6" -> (known after apply)
        id             = "terraform-20230626183101029500000002-terraform-20230626183128051200000010"
        # (3 unchanged attributes hidden)
    }

  # aws_lambda_function.root_cloudScheduleOnTick52bc3c17_8AC5BAEC will be updated in-place
  ~ resource "aws_lambda_function" "root_cloudScheduleOnTick52bc3c17_8AC5BAEC" {
        id                             = "cloud-Schedule-OnTick-52bc3c17-c8ce1e82"
      ~ last_modified                  = "2023-06-27T08:45:05.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:eu-west-2:248020555503:function:cloud-Schedule-OnTick-52bc3c17-c8ce1e82:6" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:eu-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-west-2:248020555503:function:cloud-Schedule-OnTick-52bc3c17-c8ce1e82:6/invocations" -> (known after apply)
      ~ s3_key                         = "asset.c8ce1e82e4dc4e1c2c47e323b3d9c585c3fda8f78b.bccffb41110a9072b4a86dc13009239b.zip" -> "asset.c8ce1e82e4dc4e1c2c47e323b3d9c585c3fda8f78b.7e8e0fdf547e5efbe498a719a107a1c3.zip"
        tags                           = {}
      ~ version                        = "6" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.root_testdailyreport_Handler_EC292EB5 will be updated in-place
  ~ resource "aws_lambda_function" "root_testdailyreport_Handler_EC292EB5" {
        id                             = "Handler-c88332ad"
      ~ last_modified                  = "2023-06-27T08:45:05.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:eu-west-2:248020555503:function:Handler-c88332ad:6" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:eu-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-west-2:248020555503:function:Handler-c88332ad:6/invocations" -> (known after apply)
      ~ s3_key                         = "asset.c88332ad7d8b9f9ea4c0fdff28de763435757c653b.3016c04722a35a9458a886b17cf74c57.zip" -> "asset.c88332ad7d8b9f9ea4c0fdff28de763435757c653b.91c39288d12641bb7b3a35d58bc64697.zip"
        tags                           = {}
      ~ version                        = "6" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.root_testgithub_Handler_210F9622 will be updated in-place
  ~ resource "aws_lambda_function" "root_testgithub_Handler_210F9622" {
        id                             = "Handler-c814841c"
      ~ last_modified                  = "2023-06-27T08:45:05.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:eu-west-2:248020555503:function:Handler-c814841c:6" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:eu-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-west-2:248020555503:function:Handler-c814841c:6/invocations" -> (known after apply)
      ~ s3_key                         = "asset.c814841cf01b8d42bddc4a08d74592f0f4708c8c7c.5f1aa104124ec49ef59a6ceffeef629a.zip" -> "asset.c814841cf01b8d42bddc4a08d74592f0f4708c8c7c.ad40552ecf87cb0efe87b8ba31bb91e1.zip"
        tags                           = {}
      ~ version                        = "6" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.root_testslack_Handler_6383EBD4 will be updated in-place
  ~ resource "aws_lambda_function" "root_testslack_Handler_6383EBD4" {
        id                             = "Handler-c859c345"
      ~ last_modified                  = "2023-06-27T08:45:05.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:eu-west-2:248020555503:function:Handler-c859c345:6" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:eu-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-west-2:248020555503:function:Handler-c859c345:6/invocations" -> (known after apply)
      ~ s3_key                         = "asset.c859c3453707ac3788c08b8722c2c8a136d1f97a00.7bf6b4f11c30258c7039a473e8a34d1a.zip" -> "asset.c859c3453707ac3788c08b8722c2c8a136d1f97a00.171c2a8d770eb9a84210fb0fb99b0ee2.zip"
        tags                           = {}
      ~ version                        = "6" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_permission.root_cloudScheduleOnTick52bc3c17_InvokePermissionc889a92213eec6eb0fed79fc42c0ee51e58b9f1242_B865CFAE will be created
  + resource "aws_lambda_permission" "root_cloudScheduleOnTick52bc3c17_InvokePermissionc889a92213eec6eb0fed79fc42c0ee51e58b9f1242_B865CFAE" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "cloud-Schedule-OnTick-52bc3c17-c8ce1e82"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + qualifier           = (known after apply)
      + source_arn          = "arn:aws:events:eu-west-2:248020555503:rule/terraform-20230626183101029500000002"
      + statement_id        = (known after apply)
      + statement_id_prefix = (known after apply)
    }

  # aws_s3_object.root_cloudScheduleOnTick52bc3c17_S3Object_55D4C33B must be replaced
-/+ resource "aws_s3_object" "root_cloudScheduleOnTick52bc3c17_S3Object_55D4C33B" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "bf91821dd9df2ba93a575b1fc1d3c275" -> (known after apply)
      ~ id                     = "asset.c8ce1e82e4dc4e1c2c47e323b3d9c585c3fda8f78b.bccffb41110a9072b4a86dc13009239b.zip" -> (known after apply)
      ~ key                    = "asset.c8ce1e82e4dc4e1c2c47e323b3d9c585c3fda8f78b.bccffb41110a9072b4a86dc13009239b.zip" -> "asset.c8ce1e82e4dc4e1c2c47e323b3d9c585c3fda8f78b.7e8e0fdf547e5efbe498a719a107a1c3.zip" # forces replacement
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ source                 = "assets/root_cloudScheduleOnTick52bc3c17_Asset_BD772AD0/BCCFFB41110A9072B4A86DC13009239B/archive.zip" -> "assets/root_cloudScheduleOnTick52bc3c17_Asset_BD772AD0/7E8E0FDF547E5EFBE498A719A107A1C3/archive.zip"
      ~ storage_class          = "STANDARD" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      + version_id             = (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_s3_object.root_testdailyreport_Handler_S3Object_1E303EC1 must be replaced
-/+ resource "aws_s3_object" "root_testdailyreport_Handler_S3Object_1E303EC1" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "c3b8d211052d255f43dbead2af4d5d5d" -> (known after apply)
      ~ id                     = "asset.c88332ad7d8b9f9ea4c0fdff28de763435757c653b.3016c04722a35a9458a886b17cf74c57.zip" -> (known after apply)
      ~ key                    = "asset.c88332ad7d8b9f9ea4c0fdff28de763435757c653b.3016c04722a35a9458a886b17cf74c57.zip" -> "asset.c88332ad7d8b9f9ea4c0fdff28de763435757c653b.91c39288d12641bb7b3a35d58bc64697.zip" # forces replacement
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ source                 = "assets/root_testdailyreport_Handler_Asset_01E83380/3016C04722A35A9458A886B17CF74C57/archive.zip" -> "assets/root_testdailyreport_Handler_Asset_01E83380/91C39288D12641BB7B3A35D58BC64697/archive.zip"
      ~ storage_class          = "STANDARD" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      + version_id             = (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_s3_object.root_testgithub_Handler_S3Object_22575187 must be replaced
-/+ resource "aws_s3_object" "root_testgithub_Handler_S3Object_22575187" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "2f4bec8c0c94b8c885c72f82fda8fd6a" -> (known after apply)
      ~ id                     = "asset.c814841cf01b8d42bddc4a08d74592f0f4708c8c7c.5f1aa104124ec49ef59a6ceffeef629a.zip" -> (known after apply)
      ~ key                    = "asset.c814841cf01b8d42bddc4a08d74592f0f4708c8c7c.5f1aa104124ec49ef59a6ceffeef629a.zip" -> "asset.c814841cf01b8d42bddc4a08d74592f0f4708c8c7c.ad40552ecf87cb0efe87b8ba31bb91e1.zip" # forces replacement
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ source                 = "assets/root_testgithub_Handler_Asset_C92DD061/5F1AA104124EC49EF59A6CEFFEEF629A/archive.zip" -> "assets/root_testgithub_Handler_Asset_C92DD061/AD40552ECF87CB0EFE87B8BA31BB91E1/archive.zip"
      ~ storage_class          = "STANDARD" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      + version_id             = (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_s3_object.root_testslack_Handler_S3Object_E3F129BB must be replaced
-/+ resource "aws_s3_object" "root_testslack_Handler_S3Object_E3F129BB" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "38892b3949f066626672a1e0c4a50e14" -> (known after apply)
      ~ id                     = "asset.c859c3453707ac3788c08b8722c2c8a136d1f97a00.7bf6b4f11c30258c7039a473e8a34d1a.zip" -> (known after apply)
      ~ key                    = "asset.c859c3453707ac3788c08b8722c2c8a136d1f97a00.7bf6b4f11c30258c7039a473e8a34d1a.zip" -> "asset.c859c3453707ac3788c08b8722c2c8a136d1f97a00.171c2a8d770eb9a84210fb0fb99b0ee2.zip" # forces replacement
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ source                 = "assets/root_testslack_Handler_Asset_B77133B9/7BF6B4F11C30258C7039A473E8A34D1A/archive.zip" -> "assets/root_testslack_Handler_Asset_B77133B9/171C2A8D770EB9A84210FB0FB99B0EE2/archive.zip"
      ~ storage_class          = "STANDARD" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      + version_id             = (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 5 to add, 5 to change, 4 to destroy.

```

</details>
